In [1]:
import pandas as pd
import numpy as np

###### DataFrame.duplicated(self, subset: Union[Hashable, Sequence[Hashable], NoneType] = None, keep: Union[str, bool] = 'first')

###### Parameters
subsetcolumn label or sequence of labels, optional
Only consider certain columns for identifying duplicates, by default use all of the columns.

keep{‘first’, ‘last’, False}, default ‘first’
Determines which duplicates (if any) to mark.

first : Mark duplicates as True except for the first occurrence.

last : Mark duplicates as True except for the last occurrence.

False : Mark all duplicates as True.

# removing duplicates

In [2]:
data = pd.DataFrame({"k1":["one","two"]*3+["two"],
                    "k2":[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [3]:
data.duplicated() #keep="last")  #dudplicate row

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [4]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [32]:
df = pd.DataFrame({"name": ["abiha","aliya","areesha","alisha","alisha"],"marks":[71,71,60,59,59]})

In [33]:
df

      name  marks
0    abiha     71
1    aliya     71
2  areesha     60
3   alisha     59
4   alisha     59

In [34]:
df.duplicated(keep=False)

0    False
1    False
2    False
3     True
4     True
dtype: bool

In [35]:
df.duplicated(keep="last")

0    False
1    False
2    False
3     True
4    False
dtype: bool

In [36]:
df.duplicated()

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [37]:
df["grades"] = (["a","b","c","d","d"])

In [38]:
df

      name  marks grades
0    abiha     71      a
1    aliya     71      b
2  areesha     60      c
3   alisha     59      d
4   alisha     59      d

#### drop_dupicates

###### DataFrame.drop_duplicates(self, subset: Union[Hashable, Sequence[Hashable], NoneType] = None, keep: Union[str, bool] = 'first', inplace: bool = False, ignore_index: bool = False) → Union[ForwardRef('DataFrame'), NoneType

In [40]:
df.drop_duplicates(["marks"])

      name  marks grades
0    abiha     71      a
2  areesha     60      c
3   alisha     59      d